app/Controllers/Auth.php

    public function login()
    {

        // validate input text
        $validationRule = [
            'identity' => [
                'rules' => 'required'
            ],
            'password' => [
                'rules' => 'required'
            ]
        ];

        if (!$this->validate($validationRule)) {
            $error = $this->validator->getErrors();
            $error_val = array_values($error);
            die(json_encode([
                'status' => false,
                'response' => $error_val[0]
            ]));
        }

        // input data
        $identity = $this->request->getPost('identity');
        $password = $this->request->getPost('password');

        // load model
        $userModel = new \App\Models\User();

        // find user
        $user = $userModel->select('id,username,password')->where('username', $identity)->orWhere('email', $identity)->first();
---
SELECT `id`, `username`, `password`
FROM `user`
WHERE `username` = 'robeth'
OR `email` = 'robeth'
 LIMIT 1